In [4]:
import pandas as pd
import numpy as np
import datetime

In [8]:
df1 = pd.DataFrame({'key': list('bbacaab'), 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a'], 'data2': range(3)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [10]:
df2

   data2 key
0      0   a
1      1   b
2      2   a

In [9]:
pd.merge(df1,df2) #or pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      2   a      2
5      4   a      0
6      4   a      2
7      5   a      0
8      5   a      2

In [11]:
#c are missing, by default, merge does inner join
df1 = pd.DataFrame({'lkey': list('bbacaab'), 'data1': range(7)})
df2 = pd.DataFrame({'rkey': ['a', 'b', 'a'], 'data2': range(3)})

pd.merge(df1, df2, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      2    a      2    a
5      4    a      0    a
6      4    a      2    a
7      5    a      0    a
8      5    a      2    a

In [12]:
pd.merge(df1, df2, left_on='lkey', right_on='rkey', how='left')

   data1 lkey  data2 rkey
0      0    b    1.0    b
1      1    b    1.0    b
2      2    a    0.0    a
3      2    a    2.0    a
4      3    c    NaN  NaN
5      4    a    0.0    a
6      4    a    2.0    a
7      5    a    0.0    a
8      5    a    2.0    a
9      6    b    1.0    b

## Merge with multiple keys

In [14]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 'key2': ['one', 'two', 'one'], 'lval': [1,2,3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 'key2': ['one', 'one', 'one', 'two'], 'rval': [4,5,6,7]})

left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [15]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [17]:
pd.merge(left, right, on = ['key1', 'key2'], how='left')

  key1 key2  lval  rval
0  foo  one     1   4.0
1  foo  one     1   5.0
2  foo  two     2   NaN
3  bar  one     3   6.0

# Concatenate dataframe

In [18]:
s1 = pd.Series([0,1], index=['a', 'b'])
s2 = pd.Series([2,3,4], index=['c', 'd', 'e'])
s3 = pd.Series([5,6], index=['f', 'g'])

In [19]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [26]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [28]:
s4 = pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [29]:
pd.concat([s1,s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [30]:
pd.concat([s1,s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

## Pivoting

In [43]:
data_dir = '/Users/KK/Documents/python_for_dataanalysis/Chapter_6_Data_loading/cohort_challenge.csv'
import pandas as pd

df = pd.read_csv(data_dir, sep = ',')
df.head(4)

,Date,Game,Network,Country,OS Name,Days after Install,Users,Cohort Size,FTD,Revenue
0,7/1/16,Awesome Game,Network 1s,us,iOS,0,21.0,21.0,NaN,NaN
1,7/1/16,Awesome Game,Network 1s,us,iOS,0,2.0,2.0,NaN,NaN
2,7/1/16,Awesome Game,Network 1s,us,iOS,0,2.0,2.0,NaN,NaN
3,7/1/16,Awesome Game,Network 1s,us,iOS,0,1.0,1.0,NaN,NaN

In [47]:
df_final = df.head(4)
df_final['OS Name'] = ['IOS', 'IOS', 'Android', 'Android']
df_final

/Library/Frameworks/Python.framework/Versions/3.5/lib/python3.5/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Date,Game,Network,Country,OS Name,Days after Install,Users,Cohort Size,FTD,Revenue
0,7/1/16,Awesome Game,Network 1s,us,IOS,0,21.0,21.0,NaN,NaN
1,7/1/16,Awesome Game,Network 1s,us,IOS,0,2.0,2.0,NaN,NaN
2,7/1/16,Awesome Game,Network 1s,us,Android,0,2.0,2.0,NaN,NaN
3,7/1/16,Awesome Game,Network 1s,us,Android,0,1.0,1.0,NaN,NaN

In [48]:
df_final = df_final[['Date', 'OS Name', 'Users']]

df_final.iloc[1,0] = '7/2/16'
df_final.iloc[3,0] = '7/2/16'

df_final

/Library/Frameworks/Python.framework/Versions/3.5/lib/python3.5/site-packages/pandas/core/indexing.py:517: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

     Date  OS Name  Users
0  7/1/16      IOS   21.0
1  7/2/16      IOS    2.0
2  7/1/16  Android    2.0
3  7/2/16  Android    1.0

In [42]:
df_final.pivot('Date', 'OS Name', 'Users')

OS Name  Android   IOS
Date
7/1/16       2.0  21.0
7/2/16       1.0   2.0

In [61]:
## Unpivot convert wide to long
df_final_wide = df_final.pivot('Date', 'OS Name', 'Users')
del df_final_wide.columns.name
del df_final_wide.index.name
df_final_wide['Date'] = list(df_final_wide.index)
df_final_wide.index = range(2)

df_final_wide

   Android   IOS    Date
0      2.0  21.0  7/1/16
1      1.0   2.0  7/2/16

In [62]:
pd.melt(df_final_wide, ['Date'])

     Date variable  value
0  7/1/16  Android    2.0
1  7/2/16  Android    1.0
2  7/1/16      IOS   21.0
3  7/2/16      IOS    2.0